src/cf/InformationRegisters/ПраваПоДескрипторамДоступаОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПраваПоДескрипторамДоступаОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Добавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УправлениеПравами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Чтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дескриптор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДескрипторыДоступаОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗамещающиеИПомощники</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДелегированиеПрав</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОчередьДескрипторовДляПоискаИсторическихДанныхКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОчередьДескрипторовДляПоискаИсторическихДанныхКОД</Name>
			<Comment>Очередь в ЦУ, для проверки дескрипторов, нужно ли отправить в ПУ старые объекты по этим дескрипторам</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Дескриптор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДескрипторыДоступаОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПраваПоДескрипторамДоступаОбъектов/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Холдинг_ЗанестиВОчередьДляОтслеживания();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Холдинг_ЗанестиВОчередьДляОтслеживания()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не КОДСлужебный.НужноФоновоеОбновлениеИсторическихДанных() Или Не Модифицированность() Тогда
		Возврат;
	КонецЕсли;
	
	
	СвернутыйНабор = Выгрузить();
	СвернутыйНабор.Свернуть("Дескриптор, Сотрудник");
	
	// Для одиночной записи сразу пишем, без доп. проверок:
	Если СвернутыйНабор.Количество() = 1 Тогда
		РегистрыСведений.ОчередьДескрипторовДляПоискаИсторическихДанныхКОД.СоздатьЗапись(
			СвернутыйНабор[0]);
		Возврат;
	КонецЕсли;
	
	
	// Может что-то в очереди уже есть, надо записать не все записи:
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.Дескриптор,
		|	Т.Сотрудник
		|ПОМЕСТИТЬ втСвернутыйНабор
		|ИЗ
		|	&СвернутыйНабор КАК Т
		|;
		|
		|ВЫБРАТЬ
		|	СвернутыйНабор.Дескриптор,
		|	СвернутыйНабор.Сотрудник
		|ИЗ
		|	втСвернутыйНабор КАК СвернутыйНабор
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.ОчередьДескрипторовДляПоискаИсторическихДанныхКОД КАК Очередь
		|		ПО СвернутыйНабор.Дескриптор = Очередь.Дескриптор
		|			И СвернутыйНабор.Сотрудник = Очередь.Сотрудник
		|ГДЕ
		|	Очередь.Дескриптор IS NULL");
	Запрос.УстановитьПараметр("СвернутыйНабор", СвернутыйНабор);
	ВыборкаОтсутствующиеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОтсутствующиеЗаписи.Следующий() Цикл
		РегистрыСведений.ОчередьДескрипторовДляПоискаИсторическихДанныхКОД.СоздатьЗапись(
			ВыборкаОтсутствующиеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
